{
    "styleData": [
        {
            "style-name": "Pick a style!",
            "style-picture": "images/default-style.png",
            "style-about": "",
            "opening-type": ""
        },
        {
            
            "style-name": "Aggressive",
            "style-picture": "images/aggressive-style.png",
            "style-about": "Being aggressive requires giving up material like pawns for a a huge and fast attack. \nHowever, if you don't make a significant attack then you will fail miserably.",
            "opening-type": "Suggested Opening: King's Gambit"
        },
        {
            "style-name": "Solid",
            "style-picture": "images/solid-style.png",
            "style-about": "Being solid requires knowing where to put your pieces for a slow attack. \nIf you fail to do so, then your opponent will squeeze your pieces and take your king.",
            "opening-type": "Suggested Opening: Queen's Gambit"
        },
        {
            "style-name": "Overall",
            "style-picture": "images/overall-style.png",
            "style-about": "Being an overall player requires you to know when and where to be aggressive and solid. \nDo the wrong one and your whole plan will fail. Very difficult but rewarding.",
            "opening-type": "Suggested Opening: Ruy Lopez"
        }
    ],

    "openingData": [
        {
            "opening-name": "Pick a opening!",
            "opening-picture": "images/default-opening.png",
            "opening-about": "",
            "opening-players": ""
        },
        {
            "opening-name": "King's Gambit",
            "opening-picture": "images/kings-gambit-opening.png",
            "opening-about": "1. e4 e5 2. f4!. Giving up a king pawn that weakens your king, but gives you so much space. Very dangerous for both players!",
            "opening-players": "Spassky has played this when it was popular due to less theory being known. Very tactical and leads to complex battles from both players."
        },
        {
            "opening-name": "Queen's Gambit",
            "opening-picture": "images/queens-gambit-opening.png",
            "opening-about": "1. d4 d5 2. c4!. Looks to give up a pawn but can be taken back easily. This gets space without weakening your king. Very solid due to being safe.",
            "opening-players": "Karpov has played this opening due to his posiitonal style of play of taking space little by little for small advantages that lead to a long victory."
        },
        {
            "opening-name": "Ruy Lopez",
            "opening-picture": "images/ruy-lopez-opening.png",
            "opening-about": "1. e4 e5 2. Nf3 Nc6 3. Bb5! Pinning the horse for a an attack on the king and the pawn on e5 without weakening himself. Very aggressive yet solid.",
            "opening-players": "Magnus Carlsen is perhaps the most diverse player in histroy of chess. He plays like Karpov, Spassky, and Kasparov who have very different styles and he plays this!"
        }
    ]
}